{
  "tips": [
    {
      "tip": "Try using the web app on your laptop from your phone's WiFi hotspot."
    },
    {
      "tip": "It is OK to bookmark the web app in your browser, however <strong>the IP address can change</strong> when your WiFi router is reset or power cycled."
    },
    {
      "tip": "<strong>The IP address</strong> is used to access the web app from any browser on your WiFi LAN."
    },
    {
      "tip": "Use the double-arrow recycle icon to update the IP address when network parameters have been changed."
    },
    {
      "tip": "When the dashboard shows \"Unsecured, no password\", anyone on your network can use the web app to access your phone. Select Settings-Web app user credentials to assign a username and password."
    },
    {
      "tip": "Optimize DEX gives you the ability to remove classes from the DEX, to make computation faster and bypass downstream decompile issues."
    },
    {
      "tip": "The Jadx compile operates directly on the DEX. CFR and Fernflower operate on JAR files, requiring DEX to JAR conversion."
    },
    {
      "tip": "Lucene search can be performed on the entire private storage drive, on a specific application or on a compiler specific source folder."
    },
    {
      "tip": "Settings Stack size allows you to change the memory allocation used by decompile utilities."
    },
    {
      "tip": "A decompiler is having a beer at the bar when he is heldup by a gunman. He says \"Don't do it, I can see right through you and know what you plan to do!\""
    },
    {
      "tip": "If the decompile process stalls, look at the log carefully and add any offending classes to the <strong>dex_class_exclusion.txt</strong> file, then re-optimize the DEX."
    },
    {
      "tip": "Add your own <strong>Search Sets with the Search Manager</strong>. You can search dozens of keywords and phrases at one time."
    },
    {
      "tip": "Internet search \"Lucene cheat sheet\" to find tips and tricks for effective use of this powerful search engine."
    },
    {
      "tip": "Manage <strong>Show Tips</strong> from the Settings menu. If you disable the Show Tips checkbox, tips will not be shown again.  Selecting Close tips is temporary."
    },
    {
      "tip": "Have a feature request, comment or question? Send an email to <strong>team@nuvolect.com</strong>."
    }
  ]
}